{
    "title": "Inverted Pendulum",
    "desc": "In this research project, I designed and created an inverted linear pendulum. I presented the product at the end of my junior year of high school in Extended Studies Seminar. The inverted linear pendulum used limit switches and an encoder to obtain input, and controlled the balancing rod using a stepper motor, and kevlar thread tied to the base of the rod.",
    "org": "Brighton High School: Physics Club & Extended Studies",
    "website": "bcsd.org",
    "completed": "2 June 2018",
    "text": [
        "What is an inverted linear pendulum? An inverted linear pendulum is a mechanized rod balancer. Have you ever tried to balance a meter stick on the tip of your finger? Well that is exactly what an inverted linear pendulum is, however an inverted linear pendulum has one axis fixed, so it just balances the rod in the horizontal/vertical plane. The image below shows a diagram of an inverted linear pendulum. The motor depicted on the bottom left turns a pulley, and a chord moves complementary to this action. The cart is then pulled either left or right in response. In the diagram, the cart carries the balancing section of a double linear inverted pendulum, however I have only been able to complete a single inverted linear pendulum due to inaccuracies in the encoder counting.",
        "img1",
        "The first step was to decide what I would use to move the pendulum. I narrowed it down to the following three options, each with their own advantages and disadvantages.",
        "img2",
        "Initially, I chose to use a servo due to my familiarity in using one, however this option failed. It turns out the servo I used (which was very large) just didn’t have enough torque to move the cart in changing directions fast. Additionally, the design used a drawer slider lubed with teflon lubricant, which had too much mass to be controlled by the servo. To counteract this massive (pun intended) problem, linear slides were ordered to allow smooth movement of the cart.",
        "The servo approach is shown below. You will hear banging which exemplifies the issue with the usage of a servo and drawer slide. Don't worry, I have gotten a haircut or two since this video :)",
        "<iframe width='560' height='315' src='https://www.youtube.com/embed/u3U6o5ji5Uo' title='YouTube video player' frameborder='0' allow='accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture' allowfullscreen></iframe>",
        "Due to this failure, I decided to use a stepper motor due to its advantages shown above, and because my unfamiliarity with this technology (I had only seen it on 3D printers before this) would allow me to learn in the process.",
        "The next step was to choose the input method. There were two obvious choices. Firstly, using a camera attached to the raspberry pi (the computer used to control the system) would allow for a unique inverted pendulum design, using image recognition to calculate the position of the rod at any time. This option was scrapped after finding that there was too much latency between capturing images and the program acquiring them due to the absence of a GPU. Therefore, I chose the second option of using an encoder acting as the rods axle, allowing almost instantaneous and completely accurate readings of the angular position of the rod. Additionally, limit switches were used to make sure the stepper motor couldn’t pull the linear sliding cart off the end of the linear slides.",
        "Initially, I programmed the linear pendulum on the raspberry pi. The raspberry pi connected to the encoder and the limit switches. Both of these input devices were programmed to have interrupts, so that no pulses or end position notifications were missed. However, there was an issue with this process. The raspberry pi still had too much latency because of the operating system. To fix this, I switched to an arduino.",
        "This image shows the whole setup. On the left is the x-ray camera. It is placed far away so that the refraction of the x-rays after they pass through the capsule walls has time to create a defined image. On the right is the x-ray source, which has a small spot size. In the center of the image, is the diagram on the last slide, however it is positioned into the page. Additionally, the process which takes the liquid DT meniscus to the form in which it is seen evenly distributed around the capsule is called beta layering. In this process, isotherm heating occurs. Basically in areas with more liquid (towards the bottom of the capsule), there is more energy, and therefore more heat. The radioactive element tritium is excited by this energy, and bounces around the inside of the capsule and sticks to cooler less energy areas. This deposit keeps occurring until the capsule has an approximately uniform layer of solid DT.",
        "Using the arduino, I used the same layout, using interrupts for the limit switches and encoder. Code. Below are images of the arduino when hooked up, and the rest of the electronics.",
        "img3",
        "img4",
        "In the above picture, the lowest small circuit board is the stepper driver. This is hooked to the stepper motor through a large capacitor, as seen on the radio shack plug board. The capacitor is required to prevent large current from passing through the stepper driver when a current is inducted in the motor. The stepper motor is powered through a combination of two pc power supplies, added together to give it the required ~45 volt potential to power it.",
        "Below is the code used to control the stepper, encoder, and limit switches. It involves interrupts, bit manipulation, and other code uniquities. Additionally, the stepper motor has multiple step sizes. As the rod gets more vertically up, the step size decreases, decreasing the shakiness of the system, and balancing the rod through smaller movement units.",
        "The program can be summed up most simply by the following diagram:",
        "img5",
        "The code is shown here:",
        "img6",
        "img7",
        "img8",
        "img9",
        "The code is summed up in a sequence diagram shown below",
        "img10",
        ":Results:",
        "https://www.youtube.com/watch?v=dlMxPfKm4ik",
        "Unfortunately, the rod didn’t balance infinitely, however the issue has been found to be the lack of a PID controller, and the usage of a threshold movement range. This problem is being fixed currently, and updates will soon be posted.",
        "Just one other interesting view of this, a view from a scope. This following video is the pulse width modulation (PWM) returned by the encoder as it swings in harmonic motion due to gravity.",
        "https://www.youtube.com/watch?v=r63wpYRR7X0"
    ]
}