{
    "title": "Bluetooth Electric Longboard",
    "desc": "In this research project, I designed and created a bluetooth phone controlled electric longboard. I presented the product in my sophomore year of high school in Extended Studies Seminar. The final result was an electric longboard with a top speed of approximately 16 miles per hour, and a range of 5 miles controlled over a bluetooth connection with a cellphone. I am currently upgrading the longboard, and speculate a new top speed of 25mph, with the same range. ",
    "org": "Brighton High School Extended Studies Seminar",
    "website": "bcsd.org",
    "completed": "10 June 2017",
    "text": [
        "Throughout my life, I have enjoyed biking, ripsticking, and basically all other active forms of transportation, however longing for my license had changed my perspective, and I suddenly longed for a non active but enjoyable form of transport. I did my research, and found that the cheapest option: using a gasoline motor, was illegal in the state of New York. I began brainstorming, and realized that electric vehicles must have less regulations and restrictions; after all, electric scooters are ridden all around, why not an electric skateboard?\nI had chosen my project. At first, I was obsessed with saving money; afterall, I was paying. I started by building a board, or deck for my longboard (skateboards are too small and unstable). I printed an 8 page template, taped it together, and glued it on a wooden board stored in our basement. I proceeded to use a reciprocating saw to cut out the outline of the board. I knew that the board would face harsh conditions, such as moisture, stones, and other detriment, so I finished and glossed the board. Finally, I put a sheet of grip tape picked up for approximately five dollars at a local skate shop, to allow a rough grippy surface to stand on.\nAt this point, my sophomore year of school had started, and I had reentered the research project focused class called Extended Studies Seminar. I learned that the school had a budget for this program, and I took note.\nI had finished the board, and ordered the most low-cost pair of longboard trucks (the part connecting the board to the wheels, allowing turning), sending the receipt to the school to be reimbursed.\nI then chose the most popular, and efficient/frictionless drivetrain design as shown below: ",
        "",
        "I then researched all the electronics and came up with the list of parts, as defined below\n\nTurnigy Aerodrive SK3 280kV Outrunner\n2 Zippy Flightmax 5000mAh 3S1P batteries\nLiPo Battery Charger\nHobbyKing EZRun 150A Electronic Speed Controller (ESC)\nArduino Bluetooth Module\nCell Phone - for sending a speed signal\n\nLaying out the ESC, Battery charger and batteries:",
        "",
        "I continued to work on the drivetrain. I drew a template to attach the motor to the truck of the longboard, allowing for a belt drive. The measurements for this were critical because they would determine the tension of the belt. Shown in the following images, I cut a motor mount out of aluminum using a self drawn template.",
        "",
        " I then drew a template for the wheel connection with the drive gear, and screwed it together with three long screws, washers, and nuts.",
        "",
        "",
        "The mechanical part of the build was finished, and I began work on the programming part. For sake of simplicity, I will post images of the general code layout, which allowed for the bluetooth phone application to connect with the arduino bluetooth receiver. I had help from my father, for I was initially unfamiliar with bluetooth connections.",
        "",
        "",
        "",
        "",
        "Final Results: The board functioned as planned. The phones connection with the arduino bluetooth module was strong, and never disconnected unexpectedly. The board ran with a top speed of approximately 16 miles per hour, and a range of 5 miles. An interesting perspective can be found on youtube at the following link ( https://youtu.be/dj05pqJxQ64 ), which shows the board in action, and shows the pulse width modulation (PWM) sent to the electronic speed controller (ESC) for various speeds.\nI am currently upgrading the system, using a 6374 motor with a maximum input current of 60A, adding two 5000mAh LiPo batteries, and using a VESC capable of performing under these powerful conditions."
    ]
}