{
    "title": "University of Rochester Laboratory for Laser Energetics Fusion Research",
    "desc": "After a lengthy application and interview process, 13 students were accepted to participate in a research project at the U of R LLE. Each of us was assigned a project under the supervision of a senior scientist at their institution; my project was involved in a new laser target production method to be installed on the second largest fusion laser in the world: OMEGA.",
    "org": "University of Rochester Laboratory for Laser Energetics",
    "website": "lle.rochester.edu",
    "completed": "29 Aug 2018",
    "text": [
        "Real-time x-ray imaging of liquid-DT integration with cryogenic temperature controller to autonomously produce desired solid-DT final layer thickness",
        "An alternative capsule filling technique will be implemented for targets in future OMEGA experiments. Spherical capsules will have fill tubes inserted allowing flow of deuterium-tritium (DT) liquid. The fill level is determined by the temperature of the DT liquid, which is controlled by a temperature controller. To track the fill process, a phase contrast x-ray camera images the capsule. A MATLAB script was developed to automate the filling and freezing process. This was achieved by running an instance of LightField parallel to the MATLAB script, and connecting to the National Instruments temperature controller through a GPIB-USB interface. The program continually runs a control loop which calculates the current estimation for final solid layer thickness based from real time image acquisition.",
        "This abstract was described by myself in a project symposium, which I will embark on explaining to you, the reader. If you don’t understand any concepts of this, don’t worry; I had the whole summer to take it in and process the information.",
        "",
        "On the left, you can see a fill-tube filled capsule with liquid deuterium-tritium (DT) filling the capsule. I have labeled the diameter of the capsule 2r, and the major and minor axis of the elliptical empty space above the liquid with dimensions 2a and 2c respectively. On the right, you can see the capsule after freezing and undergoing isothermal heating to become a uniform layer of DT ice (with thickness t) on the interior of the shell wall. It is important for the final layer of DT to be almost perfectly symmetric so that there is uniform compression when being fired upon by the 60 convening lasers of the OMEGA, allowing for intense pressure, and therefore intense temperature required for ignition to occur in a fusion reaction. Side Note: ignition is the term for when a fusion reaction becomes self sustaining.",
        "",
        "This slide sums up my work to advance fusion research, and should become fairly self explanatory as the explanation continues.",
        "",
        "In the diagram shown above, you see the mechanism currently used to fill the capsules. In the center of the spherical cavity, you can see the miniscule capsule, with a diameter of only 860 microns (micrometers), or about 0.086 centimeters, or about 0.03 inches. The spherical cavity is called a layering sphere. The temperature can be controlled in the layering sphere with the use of the layering sphere heater shown on the bottom, and the temperature can be read using a digital thermometer. There is an Be X-ray window so the capsule can be monitored throughout its filling process. The whole system is contained in a vacuum, and has extreme insulation allowing temperatures as low as 10 kelvin to be achieved. The other important feature on this diagram is the cold finger extension heater, which allows the fill tube to be frozen by creating an ice plug in the fill tube, and the fill process to finish once a desired amount of liquid (or final thickness after freezing) is acquired.",
        "",
        "This image shows the whole setup. On the left is the x-ray camera. It is placed far away so that the refraction of the x-rays after they pass through the capsule walls has time to create a defined image. On the right is the x-ray source, which has a small spot size. In the center of the image, is the diagram on the last slide, however it is positioned into the page. Additionally, the process which takes the liquid DT meniscus to the form in which it is seen evenly distributed around the capsule is called beta layering. In this process, isotherm heating occurs. Basically in areas with more liquid (towards the bottom of the capsule), there is more energy, and therefore more heat. The radioactive element tritium is excited by this energy, and bounces around the inside of the capsule and sticks to cooler less energy areas. This deposit keeps occurring until the capsule has an approximately uniform layer of solid DT.",
        "",
        "Enough with the introduction, this is where my work steps in. The high level logic flow is depicted in the diagram above. To read this, certain elements must be explained. LightField is the x-ray image acquisition program that directly speaks to the camera, and x-ray source. A GPIB connection is a general purpose interface bus, and was used to connect the computer to the cryogenic cooler, allowing temperature controller in the layering sphere and the fill tube. This process adjusts the temperature of the layering sphere until the desired amount of liquid is in the capsule (the desired amount of liquid is found by the user plugging in a desired final thickness, and the program calculating the volume of solid associated with this, calculating the liquid volume required (density difference between liquid and solid), and then adjusting the temperature until the image recognition chunk of the program told it that it is at the right liquid level). This has to be done by slowly adjusting the temperature, because the ratio of deuterium to tritium is not constant, and the temperature for a certain volume varies accordingly. The program waits until the volume stabilizes within 1 micron of the final thickness estimation for approximately 3 minutes, and then forms an ice plug in the fill tube. If the thickness after forming this ice plug has decreased due to liquid draining while freezing, this offset is recorded, the fill tube is heated up, and the program shoots for the desired final thickness plus this offset.",
        "",
        "This is a look within the Get Thickness function depicted on the previous slide, and shows the process to acquire the estimate for the current, final-thickness of the DT solid layer. The diagnostic program to estimate the final thickness used curve finding on images such as the ones on the first slide, as well as gaussian functions to estimate the final thickness.",
        "",
        "This slide depicts the calculations made to change the temperature, and therefore the liquid level in the capsule. A PID controller was used in order to efficiently acquire the desired thickness without much overshoot, but with brevity. The proportional term is the main factor, and uses the difference between the current estimated final thickness and the desired final thickness multiplied by some factor to decide how much to change the temperature by. The Integral function sums the area between the horizontal line of the desired thickness and the estimated thickness curve, so if the linear changes aren’t getting the program to the final thickness, it will increase the change. Finally, the derivative estimates the overshoot, and counteracts this. Working together, these three factors help efficiently and accurately control systems, such as AC units in houses, and have many industrial uses.",
        "",
        "The above image shows the final result, with the program able to reach the desired thickness from both an overfilled state and an underfilled state. The filling process is harder for the program due to a term known as “stiction”, which describes the unwillingness of the filling of the capsule, so when it starts to fill it jumps in large amounts. My program is able to achieve the final thickness and stabilize at it within 20 minutes, a large improvement over the previously hand used method.",
        "",
        "The left image shows the system with too high of a P term, causing a damped harmonic oscillation to occur. By tuning the terms, I was able to achieve stabilization within about 13 minutes as shown on the right.",
        "",
        "Acknowledgements, self explanatory. These final two images depict the x-ray refraction as passing through the capsule, requiring the need for the long length away from the capsule that the x-ray camera is at. Additionally, they show the trend of major to minor axis used to estimate the final thickness values in the diagnostic part of the program.",
        "",
        "",
        "This opportunity was truly amazing. Being able to apply some of the more advanced topics of computer science and mathematics was new and interesting; this program opened my eyes to the real world, and the many applications of widely thought to be 'theoretical' subject of mathematics."
    ]
}